import React, { Component } from 'react';

import './main.css';

import Carousel from 'react-bootstrap/Carousel';


export default class Main extends Component {

    render() {
        return(
            
            <div className="content">
                <div className="page-header" align="center">
                    <h1 id="heading">Rally</h1>
                </div>
                <Carousel>
                    <Carousel.Item>
                        <img className="d-block w-100" src="\imgs\1.jpg" />
                        <div class="card text-white bg-primary mb-3">
                            <div class="card-body">
                                <h4 class="card-title">Визначення</h4>
                                <p class="card-text">Ра́лі  — автоспортивне змагання, суть якого полягає на тому, щоб проїхати на спеціально підготованому для цього автомобілі спеціально визначеною організатором змагання трасою у заздалегідь визначений термін та/або у найкоротший час від місця старту до місця фінішу. На час проведення змагань дороги, якими прокладено трасу спеціальних ділянок, закриті для всіх користувачів, крім учасників гонки.</p>
                            </div>
                        </div>
                    </Carousel.Item>
                    <Carousel.Item>
                        <img className="d-block w-100" src="\imgs\2.jpg" />
                        <div class="card text-white bg-primary mb-3">
                            <div class="card-body">
                                <h4 class="card-title">Правила</h4>
                                <p class="card-text">Змагання проводяться відповідно до вимог Міжнародної Автомобільної Федерації (FIA) згідно з регламентом. Траси ралійних змагань зазвичай прокладаються дорогами загального користування, на відміну від шосейно-кільцевих перегонів та ралі-кросів, де змагання відбуваються на спеціально облаштованих трасах. Чемпіонати з ралійних дисциплін складаються з декількох етапів, згідно з заздалегідь затвердженим календарем. Кожен етап відбувається на окремій трасі. Етапи змагань багатоденні, тривалість — від 2-х днів.</p>
                            </div>
                        </div>
                    </Carousel.Item>
                    <Carousel.Item>
                        <img className="d-block w-100" src="\imgs\3.jpg" />
                        <div class="card text-white bg-primary mb-3">
                            <div class="card-body">
                                <h4 class="card-title">Учасники</h4>
                                <p class="card-text">У змаганнях з авторалі беруть участь як окремі екіпажі, так і ралійні команди, які складаються з декількох (2 — 3) екіпажів. Ралійний екіпаж складається з двох осіб: пілота і штурмана. Пілот та штурман окрім водійських прав міжнародного зразка повинні мати ліцензії на участь у змаганнях. Існують також вікові обмеження на участь у ралійних змаганнях. У більшості випадків участь у змаганнях можуть брати спортсмени не молодше 18 років. </p>
                            </div>
                        </div>
                    </Carousel.Item>
                    <Carousel.Item>
                        <img className="d-block w-100" src="\imgs\4.jpg" />
                        <div class="card text-white bg-primary mb-3">
                            <div class="card-body">
                                <h4 class="card-title">Автомобілі</h4>
                                <p class="card-text">В ралі використовуються переважно серійні легкові автомобілі з деякими конструктивними змінами. Ралійні автомобілі поділяються на класи та групи залежно від конструктивних особливостей (тип приводу, потужність двигуна та ін.). Класифікація ралійних автомобілів затверджується FIA, однак національні федерації мають право для своїх першостей вводити додаткові класи. </p>
                            </div>
                        </div>
                    </Carousel.Item>
                </Carousel>
            </div>
        )
    }

}